FEATURE SPLITING

In [10]:
import numpy as np                
import pandas as pd

In [11]:
df=pd.read_csv(r"C:\Users\om420\Downloads\titanic_10000.csv")[['Name']]
df.shape

(10000, 1)

In [12]:
df['Title']=df['Name'].str.split(',').str[1].str.split('.').str[0]

In [15]:
df[['Title','Name']]

        Title                                               Name
0          Mr                            Braund, Mr. Owen Harris
1         Mrs  Cumings, Mrs. John Bradley (Florence Briggs Th...
2        Miss                             Heikkinen, Miss. Laina
3         Mrs       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4          Mr                           Allen, Mr. William Henry
...       ...                                                ...
9995       Mr                                   Moran, Mr. James
9996       Mr                            McCarthy, Mr. Timothy J
9997   Master                     Palsson, Master. Gosta Leonard
9998      Mrs  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
9999      Mrs                Nasser, Mrs. Nicholas (Adele Achem)

[10000 rows x 2 columns]